////////////////////////////////////////////////////////////////////////////////////////////
// FireState.h
//----------------------------------------------------------------------------------------
// ì¬ÒF–ö‘ò ”¿‹M
//----------------------------------------------------------------------------------------
// ”­Ëó‘Ô‚ÉŠÖ‚·‚é‚±‚Æ
//-----------------------------------------------------------------------------------------
// 2020/01/11	ì¬
//				
//
///////////////////////////////////////////////////////////////////////////////////////////


#pragma once

#include "EnemyState.h"

class HierarchyEnemyState;

class FireState :public EnemyState
{
public:
	static FireState *GetInstance()
	{
		static FireState instance;
		return &instance;
	}

	virtual void Init(Enemy *);
	virtual void Update(Enemy *, HierarchyEnemyState *parent);
};
