////////////////////////////////////////////////////////////////////////////////////////////
// HierarchyEnemyState.h
//----------------------------------------------------------------------------------------
// 作成者：柳沢 帆貴
//----------------------------------------------------------------------------------------
// Stateを管理しやすくするため階層ごとに分ける抽象クラス
//-----------------------------------------------------------------------------------------
// 2020/11/24	作成
//				
//
///////////////////////////////////////////////////////////////////////////////////////////


#pragma once

//#define DISTANCE (250.0f)

class Enemy;
class EnemyState;

// 階層用基底状態　　　抽象クラス
class HierarchyEnemyState
{
public:
	virtual ~HierarchyEnemyState() {}

	virtual void Init       (Enemy *)          = 0;
	virtual void Update     (Enemy *)          = 0;
	virtual void ChangeState(Enemy *, EnemyState *) = 0;

protected:
};