////////////////////////////////////////////////////////////////////////////////////////////
// SceneState.h
//----------------------------------------------------------------------------------------
// ì¬ÒF–ö‘ò ”¿‹M
//----------------------------------------------------------------------------------------
// Scene‚Ìó‘Ô‚ÉŠÖ‚·‚é‚±‚Æ‚Ì’ŠÛƒNƒ‰ƒX
//-----------------------------------------------------------------------------------------
// 2020/12/23	ì¬
//				
//
///////////////////////////////////////////////////////////////////////////////////////////


#pragma once

class Scene;
class HierarchySceneState;

class SceneState
{
public:
	virtual ~SceneState() {}
	virtual void Init(Scene *) = 0;
	virtual void Uninit(Scene *) = 0;
	virtual void Update(Scene *, HierarchySceneState *) = 0;
	virtual void Draw(Scene *, HierarchySceneState *) = 0;
};